#pragma once
#include "Common.h"
#include "ccAdvBaseAnm.h"
#include "Vector3.h"

class ccStageAnm
{
public:
	__int64 vtable; // 0x00 to 0x08
	char padding0[0x08]; // 0x08 to 0x10
	int m_int01_10; // 0x10 to 0x14
	char padding1[0x0C]; // 0x14 to 0x20
	ccAdvBaseAnm* m_advBaseAnm; // 0x20 to 0x28
	char padding2[0x18]; // 0x28 to 0x40
	char m_str_40[8]; // 0x40 to 0x48
	char padding3[0x38]; // 0x48 to 0x80
	int m_int02_80; // 0x80 to 0x84
	float m_float00; // 0x84 to 0x88
	int m_int03_88; // 0x88 to 0x8C
	int m_int04_8C; // 0x8C to 0x90
	int m_int05_90; // 0x90 to 0x94
	int m_int06_94; // 0x94 to 0x98
	int m_int07_98; // 0x98 to 0x9C
	Vector3 m_vector00; // 0x9C to 0xA8
	char padding4[0x40]; // 0xA8 to 0xE8
	__int64 m_unkptr_E8; // 0xE8 to 0xF0
};